
"_diagnosticsReportStartAlertMessageText" = "Create Diagnostics Report";
"_diagnosticsReportStartAlertInformativeText" = "Little Snitch will now collect information about your Little Snitch installation (rules, profiles, log files) and your computer (OS version, CPU type, time since restart, system and kernel log files).\n\nThe report will be saved to your Desktop. This may take a few seconds.";
"_authorizationPanelMessage" = "Little Snitch needs an administrator password in order to read all required files.";

"_diagnosticsReportFinishedAlertMessageText" = "Diagnostics report saved";
"_diagnosticsReportFinishedAlertInformativeText" = "The diagnostics report created by Little Snitch has been saved to your Desktop.";

"_diagnosticsReportZipExecNotFoundMessageText" = "File compression utility not found";
"_diagnosticsReportZipExecNotFoundInformativeTextFormat %@" = "The file compression utility could not be found at the expected location: \n%@.\nDiagnostics will be aborted.";

"_diagnosticsReportZippingFailedMessageText" = "Error while compressing data";
"_diagnosticsReportZippingFailedInformativeTextFormat %@" = "An error occurred during the attempt to compress the collected data: %@";

"_diagnosticsReportFailedMessageText" = "Creating the diagnostics report failed";
"_diagnosticsReportFailedInformativeText" = "An error occurred during the attempt to create the diagnostics report.";
